app/controllers/api/v1/suggestions_controller.rb

INSERT INTO "suggestions" ("res_id", "vote_up", "vote_down", "username", "user_id", "res_name", "res_cuisines", "res_location", "res_menu_url", "res_image", "res_url", "res_user_rating", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create

  	@suggestion = Suggestion.new(user_id: current_user[:id], username: current_user[:username], res_id: params[:res_id], vote_up: 0, vote_down: 0, res_name: params[:res_name], res_cuisines: params[:res_cuisines], res_location: params[:res_location], res_image: params[:res_image], res_url: params[:res_url], res_user_rating: params[:res_user_rating], res_menu_url: params[:res_menu_url], room_id: params[:room_id])

  	@suggestion.save

SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "suggestions" SET "vote_down" = $1, "updated_at" = $2 WHERE "suggestions"."id" = $3  [["vote_down", 1], ["updated_at", "2017-09-12 18:47:46.380773"], ["id", 1]]
---
  def update
  	@suggestion = Suggestion.find(params[:id])
  	if params[:vote] == "up"
  		@suggestion.update(vote_up: @suggestion.vote_up + 1)

SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "suggestions" WHERE "suggestions"."id" = $1  [["id", 4]]
---
  def destroy
  	@suggestion = Suggestion.find(params[:id])
  	@suggestion.destroy